In [1]:
import pandas as pd

In [2]:
# Load raw data
df = pd.read_csv(r'C:\Users\oytun\Downloads\Berlin_pop_stat - Berlin Residents by marital status.csv')

In [3]:
df.head()

,neighbourhood,total_residents,single,married,widowed,\ndivorced,civil_partnership
0,Mitte,397004,240196,113277,13119,28623,1789
1,Friedrichshain-Kreuzberg,292624,188392,76076,7369,19227,1560
2,Pankow,427276,246687,130125,17014,31848,1602
3,Charlottenburg-Wilmersdorf,343500,176967,114706,17823,32281,1723
4,Spandau,259277,125965,93781,15779,23333,419

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   neighbourhood      13 non-null     object
 1   total_residents    13 non-null     int64
 2   single             13 non-null     int64
 3   married            13 non-null     int64
 4   widowed            13 non-null     int64
 5
divorced          13 non-null     int64
 6   civil_partnership  13 non-null     int64
dtypes: int64(6), object(1)
memory usage: 860.0+ bytes

In [5]:
df.isnull().sum()

neighbourhood        0
total_residents      0
single               0
married              0
widowed              0
\ndivorced           0
civil_partnership    0
dtype: int64

In [6]:
df.columns

Index(['neighbourhood', 'total_residents', 'single', 'married', 'widowed',
       '\ndivorced', 'civil_partnership'],
      dtype='object')

In [7]:
df.columns = df.columns.str.replace('\n', '', regex=True)

In [8]:
df.columns

Index(['neighbourhood', 'total_residents', 'single', 'married', 'widowed',
       'divorced', 'civil_partnership'],
      dtype='object')

In [9]:
df.columns = df.columns.str.replace('\n', '', regex=True) \
                       .str.replace('-', '', regex=True) \
                       .str.lower()

In [10]:
df.columns

Index(['neighbourhood', 'total_residents', 'single', 'married', 'widowed',
       'divorced', 'civil_partnership'],
      dtype='object')

In [11]:
df

,neighbourhood,total_residents,single,married,widowed,divorced,civil_partnership
0,Mitte,397004,240196,113277,13119,28623,1789
1,Friedrichshain-Kreuzberg,292624,188392,76076,7369,19227,1560
2,Pankow,427276,246687,130125,17014,31848,1602
3,Charlottenburg-Wilmersdorf,343500,176967,114706,17823,32281,1723
4,Spandau,259277,125965,93781,15779,23333,419
5,Steglitz-Zehlendorf,310044,143312,118049,20117,27789,777
6,Tempelhof-Schöneberg,356959,183234,121863,19149,30838,1875
7,Neukölln,329488,180627,105135,16643,26095,988
8,Treptow-Köpenick,297236,153570,100905,17375,24751,635
9,Marzahn-Hellersdorf,294091,145307,105385,16190,26757,452
10,Lichtenberg,315548,174707,97844,16316,25938,743
11,Reinickendorf,274098,131052,100221,17577,24812,436
12,Berlin,3897145,2090016,1277367,194471,322292,12999

In [12]:
df.isnull().sum()

neighbourhood        0
total_residents      0
single               0
married              0
widowed              0
divorced             0
civil_partnership    0
dtype: int64

In [13]:
df.describe()

,total_residents,single,married,widowed,divorced,civil_partnership
count,1.300000e+01,1.300000e+01,1.300000e+01,13.000000,13.000000,13.000000
mean,5.995608e+05,3.215409e+05,1.965180e+05,29918.615385,49583.384615,1999.846154
std,9.919366e+05,5.326408e+05,3.250467e+05,49541.584614,82017.448101,3351.268264
min,2.592770e+05,1.259650e+05,7.607600e+04,7369.000000,19227.000000,419.000000
25%,2.940910e+05,1.453070e+05,1.002210e+05,16190.000000,24812.000000,635.000000
50%,3.155480e+05,1.769670e+05,1.053850e+05,17014.000000,26757.000000,988.000000
75%,3.569590e+05,1.883920e+05,1.180490e+05,17823.000000,30838.000000,1723.000000
max,3.897145e+06,2.090016e+06,1.277367e+06,194471.000000,322292.000000,12999.000000

In [14]:
# Export the cleaned and transformed DataFrame to a CSV file
df.to_csv('berlin_residents_by_marital.csv', index=False)